Public Member Functions | Public Attributes | List of all members
ACAPI::Error Struct Reference
API Infrastructure
Error type for ACAPI::Result containing an error message and an error code. More...
#include <Result.hpp>
 Public Member Functions
Error (GSErrCode kind, const std::string &text)
Error (GSErrCode kind, std::string &&text)
bool  | operator== (const Error &rhs) const
 Public Attributes
GSErrCode  | kind
std::string  | text
Detailed Description
Error type for ACAPI::Result containing an error message and an error code.
Constructor & Destructor Documentation
◆ Error() [1/2]
 ACAPI::Error::Error  |  ( |  GSErrCode  |  kind,
|  const std::string &  |  text
)
inline
◆ Error() [2/2]
 ACAPI::Error::Error  |  ( |  GSErrCode  |  kind,
|  std::string &&  |  text
)
inline
Member Function Documentation
◆ operator==()
 bool ACAPI::Error::operator==  |  ( |  const Error &  |  rhs | ) |   const
inline
Member Data Documentation
◆ kind
 GSErrCode ACAPI::Error::kind
◆ text
 std::string ACAPI::Error::text